docs/ll-abella.org
#+title: ll-abella paper

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="custom.css">
#+OPTIONS: num:2 toc:2

------
[[file:index.org][Homepage]]

These are (first-reading) notes and some TODOs for the ll-abella paper.

* Paper
-http://www.gisellereis.com/papers/ll-abella-long.pdf
- Metatheory of Sequent Calculi in Abella for Linear Logic


* TODO Summary
- Uses Abella instead of Coq.
- Its language is relational in that it uses rules as clauses similar to logic programming.
- They define operations on multisets (=adj= and =merge=) for the explicit context.
- They formalize MALL and other systems. There is a long section on the cut admissibility proof.
- First formalization of cut-elimination for linear logic.

* Intro

- Informal proofs are error prone
- Multisets (used for linear logic sequent calculi) are tricky when formalizing metatheory
- They follow and formalize some textbook induictive proofs
- Abella has a two level approach facilitating binders, which avoids solutions such as Parameteric HOAS.
- Systems considered: Propositional MALL, FO MALL, Propositional MELL.

* Abella
- Based on Pure STLC for the term language
- Equality predicate for \alpha\beta\nu-equivalence
- Uninterpreted constants are constructors
- Least and greatest fixed point definitions for =prop= (This is like inductive principles for Prop)
- Underlying logic is called G.
** Quantifiers in Abella
- Extensional universal quantification =forall=
- =\triangledown= is intensional quantification
- =\exists= is existential quantification

** Relational

- Here is a small example of a relational definition of plus.

#+BEGIN_SRC abella
Define plus : nat -> nat -> nat -> prop
; plus z X X
; plus (s X) Y (s Z) := plus X Y Z
#+END_SRC

This says that zero plus =X= is =X=, and =s X= plus =Y= is =s Z= if =Z= is =plus X Y=.

- Each clause is separatexd by a =;= with head and optional body.

- Can have non-determinism and non-termination for unfolding relations because their heads can overlap.


** TODO Proof by induction
- Try the proof at page 5 in Abella:
-
   #+BEGIN_SRC abella
 Theorem plus_z_2 : forall X, plus X z X.

   Define is_nat : nat -> prop by
 ; is_nat z
 ; is_nat (s X) := is_nat X

 (* Now, we rewrite the theorem as *)

 Theorem plus_z_2 : forall X, is_nat X -> plus X z X
   #+END_SRC

- The proof begins by the tactic =induction on 1=, whcih indicates the induction on the first assumption on =is_nat X=. There are two cases to consider because there are two definitional clauses for =is_nat= (...)

**** Annotations

Abella reasons by induction on the sizee of the inductive argument.

#+BEGIN_SRC abella
IH : forall X, is_nat X * -> plus X z X
forall X, is_nat X @ -> plus X z X
#+END_SRC

- =is_nat X *= stands for an instance of =is_nat= that is strictly smaller than the initial =is_nat X= in the goal.

- =is_nat X @= indicates that its size is such that every =*=-annotated instance is strictly smaller.

** TODO Induction for metatheory
- See page 6 for an example on =ack=.

- Size annotations represent strong inductions on linearly ordered sizes.

- Meta-theoretic proofs however use inductions on more complex orderings such as lexicographic orderings.

- While =G=, the logic under Abella has a general induction rule that can represent any well-ordering, we need to generalize it further for lexicographic induction

** TODO Typing predicates
- The rest of the paper follows a certain style of specifications (which?) where typing predicates like =is_nat= are not explicitly assumed but are produced by inversion on a different predicate.

  #+BEGIN_SRC abella
Theorem plus_is : forall X Y Z, plus X Y Z ->
is_nat X /\ is_nat Y /\ is_nat Z.
  #+END_SRC

  WE see here that we don't need to assume both =is_nat X= and =plus X Y Z= because =plus X Y Z= derives =is_nat X=.

  Now we have
#+BEGIN_SRC abella
Define plus : nat -> nat -> nat -> prop
; plus z X X := is_nat X
; plus (s X) Y (s Z) := plus X Y Z
#+END_SRC

=is_nat X= is added. This lets us prove =plus_is= (TODO) by straightforward induction on =plus X Y Z=.

** TODO Two Level Logic Approach

- We can define a predicate in Abella that defines the derivability of the sequent calculus in LJ. As in, we can represent inference rules as a inductive predicate, like how in Coq we have LJ as a inductive proposition.

- Weakening and contraction are height-preserving admissible in LJ (?)

- Two level logic approach from Gacek, Miller, Nadathur (2011)
* Context representation design:

