docs/ll-abella.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-20 Tue 14:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ll-abella paper</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">ll-abella paper</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge201526">1. Paper</a></li>
<li><a href="#orgdf58b57">2. <span class="todo TODO">TODO</span> Summary</a></li>
<li><a href="#org1ff6419">3. Intro</a></li>
<li><a href="#org6cf5433">4. Abella</a>
<ul>
<li><a href="#org900734b">4.1. Quantifiers in Abella</a></li>
<li><a href="#org331e827">4.2. Relational</a></li>
<li><a href="#org0a53690">4.3. <span class="todo TODO">TODO</span> Proof by induction</a></li>
<li><a href="#org0990ec2">4.4. <span class="todo TODO">TODO</span> Induction for metatheory</a></li>
<li><a href="#org2ee5519">4.5. <span class="todo TODO">TODO</span> Typing predicates</a></li>
<li><a href="#org397e7e3">4.6. <span class="todo TODO">TODO</span> Two Level Logic Approach</a></li>
</ul>
</li>
<li><a href="#orgaa0a4b0">5. Context representation design:</a>
<ul>
<li><a href="#orgee12ab6">5.1. Problem with contexts</a></li>
<li><a href="#orga3cd51d">5.2. Idea: <code>adj</code>, <code>merge</code>, <code>perm</code></a></li>
<li><a href="#orgab72835">5.3. <span class="todo TODO">TODO</span> Code</a></li>
<li><a href="#org8847120">5.4. Multiset Theorems</a></li>
</ul>
</li>
<li><a href="#orge40f269">6. MALL (Multiplicative additive linear logic)</a>
<ul>
<li><a href="#org373c61f">6.1. Formulas</a></li>
<li><a href="#org61a7e66">6.2. <span class="todo TODO">TODO</span> Inference rules</a></li>
<li><a href="#org71be7db">6.3. Exchange rule (implicit)</a></li>
<li><a href="#orgfb99796">6.4. <span class="todo TODO">TODO</span> Duality and inversions</a></li>
</ul>
</li>
<li><a href="#orgac718a8">7. Cut elim for MALL</a>
<ul>
<li><a href="#org867cabe">7.1. <span class="todo TODO">TODO</span> Statement</a></li>
<li><a href="#orgffb249b">7.2. <span class="todo TODO">TODO</span> Proof strategy</a></li>
<li><a href="#orgb9d1acb">7.3. <span class="todo TODO">TODO</span> Cut Admissiblity for Exponential Case</a></li>
</ul>
</li>
<li><a href="#org1fe9d83">8. <span class="todo TODO">TODO</span> First-order case</a>
<ul>
<li><a href="#org521cae4">8.1. <span class="todo TODO">TODO</span> Two Level logic approcach</a></li>
</ul>
</li>
<li><a href="#orgfe1cb9b">9. <span class="todo TODO">TODO</span> Focused Calculi</a></li>
<li><a href="#org0385b22">10. <span class="todo TODO">TODO</span> Two Sided Calculi</a></li>
<li><a href="#org0134233">11. Related Work</a></li>
</ul>
</div>
</div>
<hr />
<p>
<a href="index.html">Homepage</a>
</p>

<p>
These are (first-reading) notes and some TODOs for the ll-abella paper.
</p>
<div id="outline-container-orge201526" class="outline-2">
<h2 id="orge201526"><span class="section-number-2">1.</span> Paper</h2>
<div class="outline-text-2" id="text-1">
<p>
-<a href="http://www.gisellereis.com/papers/ll-abella-long.pdf">http://www.gisellereis.com/papers/ll-abella-long.pdf</a>
</p>
<ul class="org-ul">
<li>Metatheory of Sequent Calculi in Abella for Linear Logic</li>
</ul>
</div>
</div>
<div id="outline-container-orgdf58b57" class="outline-2">
<h2 id="orgdf58b57"><span class="section-number-2">2.</span> <span class="todo TODO">TODO</span> Summary</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Uses Abella instead of Coq.</li>
<li>Its language is relational in that it uses rules as clauses similar to logic programming.</li>
<li>They define operations on multisets (<code>adj</code> and <code>merge</code>) for the explicit context.</li>
<li>They formalize MALL and other systems. There is a long section on the cut admissibility proof.</li>
<li>First formalization of cut-elimination for linear logic.</li>
</ul>
</div>
</div>
<div id="outline-container-org1ff6419" class="outline-2">
<h2 id="org1ff6419"><span class="section-number-2">3.</span> Intro</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Informal proofs are error prone</li>
<li>Multisets (used for linear logic sequent calculi) are tricky when formalizing metatheory</li>
<li>They follow and formalize some textbook induictive proofs</li>
<li>Abella has a two level approach facilitating binders, which avoids solutions such as Parameteric HOAS.</li>
<li>Systems considered: Propositional MALL, FO MALL, Propositional MELL.</li>
</ul>
</div>
</div>
<div id="outline-container-org6cf5433" class="outline-2">
<h2 id="org6cf5433"><span class="section-number-2">4.</span> Abella</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Based on Pure STLC for the term language</li>
<li>Equality predicate for &alpha;&beta;&nu;-equivalence</li>
<li>Uninterpreted constants are constructors</li>
<li>Least and greatest fixed point definitions for <code>prop</code> (This is like inductive principles for Prop)</li>
<li>Underlying logic is called G.</li>
</ul>
</div>
<div id="outline-container-org900734b" class="outline-3">
<h3 id="org900734b"><span class="section-number-3">4.1.</span> Quantifiers in Abella</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Extensional universal quantification <code>forall</code></li>
<li><code>\triangledown</code> is intensional quantification</li>
<li><code>\exists</code> is existential quantification</li>
</ul>
</div>
</div>
<div id="outline-container-org331e827" class="outline-3">
<h3 id="org331e827"><span class="section-number-3">4.2.</span> Relational</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Here is a small example of a relational definition of plus.</li>
</ul>

<div class="org-src-container">
<pre class="src src-abella">Define plus : nat -&gt; nat -&gt; nat -&gt; prop
; plus z X X
; plus (s X) Y (s Z) := plus X Y Z
</pre>
</div>

<p>
This says that zero plus <code>X</code> is <code>X</code>, and <code>s X</code> plus <code>Y</code> is <code>s Z</code> if <code>Z</code> is <code>plus X Y</code>.
</p>

<ul class="org-ul">
<li>Each clause is separatexd by a <code>;</code> with head and optional body.</li>

<li>Can have non-determinism and non-termination for unfolding relations because their heads can overlap.</li>
</ul>
</div>
</div>
<div id="outline-container-org0a53690" class="outline-3">
<h3 id="org0a53690"><span class="section-number-3">4.3.</span> <span class="todo TODO">TODO</span> Proof by induction</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Try the proof at page 5 in Abella:</li>
<li><div class="org-src-container">
<pre class="src src-abella"> Theorem plus_z_2 : forall X, plus X z X.

   Define is_nat : nat -&gt; prop by
 ; is_nat z
 ; is_nat (s X) := is_nat X

 (* Now, we rewrite the theorem as *)

 Theorem plus_z_2 : forall X, is_nat X -&gt; plus X z X
</pre>
</div></li>

<li>The proof begins by the tactic <code>induction on 1</code>, whcih indicates the induction on the first assumption on <code>is_nat X</code>. There are two cases to consider because there are two definitional clauses for <code>is_nat</code> (&#x2026;)</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org1390e42"></a>Annotations<br />
<div class="outline-text-5" id="text-org1390e42">
<p>
Abella reasons by induction on the sizee of the inductive argument.
</p>

<div class="org-src-container">
<pre class="src src-abella">IH : forall X, is_nat X * -&gt; plus X z X
forall X, is_nat X @ -&gt; plus X z X
</pre>
</div>

<ul class="org-ul">
<li><code>is_nat X *</code> stands for an instance of <code>is_nat</code> that is strictly smaller than the initial <code>is_nat X</code> in the goal.</li>

<li><code>is_nat X @</code> indicates that its size is such that every <code>*</code>-annotated instance is strictly smaller.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org0990ec2" class="outline-3">
<h3 id="org0990ec2"><span class="section-number-3">4.4.</span> <span class="todo TODO">TODO</span> Induction for metatheory</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>See page 6 for an example on <code>ack</code>.</li>

<li>Size annotations represent strong inductions on linearly ordered sizes.</li>

<li>Meta-theoretic proofs however use inductions on more complex orderings such as lexicographic orderings.</li>

<li>While <code>G</code>, the logic under Abella has a general induction rule that can represent any well-ordering, we need to generalize it further for lexicographic induction</li>
</ul>
</div>
</div>
<div id="outline-container-org2ee5519" class="outline-3">
<h3 id="org2ee5519"><span class="section-number-3">4.5.</span> <span class="todo TODO">TODO</span> Typing predicates</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li><p>
The rest of the paper follows a certain style of specifications (which?) where typing predicates like <code>is_nat</code> are not explicitly assumed but are produced by inversion on a different predicate.
</p>

<div class="org-src-container">
<pre class="src src-abella">Theorem plus_is : forall X Y Z, plus X Y Z -&gt;
is_nat X /\ is_nat Y /\ is_nat Z.
</pre>
</div>

<p>
WE see here that we don&rsquo;t need to assume both <code>is_nat X</code> and <code>plus X Y Z</code> because <code>plus X Y Z</code> derives <code>is_nat X</code>.
</p>

<p>
Now we have
</p></li>
</ul>
<div class="org-src-container">
<pre class="src src-abella">Define plus : nat -&gt; nat -&gt; nat -&gt; prop
; plus z X X := is_nat X
; plus (s X) Y (s Z) := plus X Y Z
</pre>
</div>

<p>
<code>is_nat X</code> is added. This lets us prove <code>plus_is</code> (TODO) by straightforward induction on <code>plus X Y Z</code>.
</p>
</div>
</div>
<div id="outline-container-org397e7e3" class="outline-3">
<h3 id="org397e7e3"><span class="section-number-3">4.6.</span> <span class="todo TODO">TODO</span> Two Level Logic Approach</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>We can define a predicate in Abella that defines the derivability of the sequent calculus in LJ. As in, we can represent inference rules as a inductive predicate, like how in Coq we have LJ as a inductive proposition.</li>

<li>Weakening and contraction are height-preserving admissible in LJ (?)</li>

<li>Two level logic approach from Gacek, Miller, Nadathur (2011)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaa0a4b0" class="outline-2">
<h2 id="orgaa0a4b0"><span class="section-number-2">5.</span> Context representation design:</h2>
<div class="outline-text-2" id="text-5">
</div>
