docs/ll-abella.org
** Problem with contexts
We quote the motivation for defining =adj= (and =merge= and =perm=).

#+BEGIN_QUOTE
There is a wider than expected design space here. A first attempt might be
to simply use olist as our representation of contexts, with addition of elements
represented by list consing =(::)= and context joining with list append. This
makes inductive reasoning on contexts rather straightforward, but, because
linear contexts are structurally identical modulo exchange, it requires adding
explicit exchange rules to the system, which complicates the meta-theory. An
alternative that works is still to use olist as our representation, but to relax
the notion of structural identity as follows: two lists are structurally identical if
one is a permutation of the other. Thus, we need a predicate =perm : olist
-> olist -> prop= to recognize list permutations.
To define the addition operation with this modified notion, we could continue
to use list cons, but this will still require an explicit exchange rule. Instead, we
define a generalized cons operation, called =adj=
#+END_QUOTE

** Idea: =adj=, =merge=, =perm=
- Multisets

- They have typing predicates =is_o= (=o= means formula) and =is_list= (=olist= typing predicate). They are straightforward.

- =adj= is a generalized, non-deterministic cons operation. =adj J A K= says that the context =K= is the same as =J= but with =K= inserted somewhere.

- =perm= is list equality modulo ordering. As in, =perm J K= means that =J= and =K= have the same elements. This is done by multiple =adj=; A list =J= is a permutation of =K= if for all elements =A= in (=adj KK A K=) in =K=, it is in =L= (=adj LL A L=).

- =merge J K L= says that =L= is the union of =J= and =K=.
  =merge= is non-deterministic because it has overlapping heads.
  It says that =L= is the union of =J= and =K= (1) if for =A= in =J= (=adj JJ A J=), it is in =L= (=adj LL A L=) and (2) similarly for =A= in =K=.


** TODO Code

Here is the code.

  #+BEGIN_SRC abella
Type is_o o - > prop .
Define is_list : olist - > prop by
; is_list nil
; is_list ( A :: L ) := is_o A /\ is_list L .
% adj J A K : K is J with A inserted somewhere
Define adj : olist - > o - > olist - > prop by
; adj L A ( A :: L ) := is_o A /\ is_list L
; adj ( B :: K ) A ( B :: L ) := is_o B /\ adj K A L .
% merge J K L : J union K equals L .
Define merge : olist - > olist - > olist - > prop by
; merge nil nil nil
; merge J K L := exists A JJ LL , adj JJ A J /\ adj LL A L /\
merge JJ K LL
; merge J K L := exists A KK LL , adj KK A K /\ adj LL A L /\
merge J KK LL .
% perm J K : J and K have the same elements
Define perm : olist - > olist - > prop by
; perm nil nil
; perm K L :=
exists A KK LL , adj KK A K /\ adj LL A L /\ perm KK LL .
  #+END_SRC

  - Notice the overlapping heads for =merge=, which makes it nondeterministic.
  - (?) Why is =adj= non-deterministic?
  -  Why do they have the existential quantifiers?


** Multiset Theorems

The files =lib/merge.thm= and =lib/perm.thm= containts theorems about multisets.

Examples:
- =merge= is stable under permutation. If =L= is the union of =J= and =K=, and =JJ= is the same as =J= modulo permutation, then =L= is also the union of =JJ= and =K=.

  #+BEGIN_SRC abella
  Theorem perm_merge_1 : forall J K L JJ,
  merge J K L - > perm J JJ - > merge JJ K L .
  #+END_SRC

- =merge= is associative. Apparently this requires establishing that =perm= is an equivalence (transitive, reflexive, symmetric).

  #+BEGIN_SRC abella
  Theorem merge_assoc : forall J K L JK KL JKL1 JKL2 ,
  merge J K JK - > merge K L KL - >
  merge J KL JKL1 - > merge JK L JKL2 - >
  perm JKL1 JKL2 .
#+END_SRC

* MALL (Multiplicative additive linear logic)
** Formulas

We seem to define the connectives as their own types, then define a formula inductively (typing predicate). Constrast this to SML or Coq where you simply define formulas as an inductive datatype.

#+BEGIN_SRC abella
Type atom , natom atm - > o .
Type tens , par o - > o - > o .
Type one , bot o .
Type wth , plus o - > o - > o .
Type top , zero o .

Define is_fm : o - > prop by
; is_fm ( atom A )
; is_fm ( natom A )
; is_fm ( tens A B ) := is_fm A /\ is_fm B
; is_fm one
; is_fm ( par A B ) := is_fm A /\ is_fm B
; is_fm bot
; is_fm ( wth A B ) := is_fm A /\ is_fm B
; is_fm top
; is_fm ( plus A B ) := is_fm A /\ is_fm B
; is_fm zero .
#+END_SRC

** TODO Inference rules

Here is the code for the inference rules of the fragment of MALL.

#+BEGIN_SRC
Define mall : olist - > prop by
; mall L := exists A , adj ( natom A :: nil ) ( atom A ) L
; mall L := exists A B LL JJ KK J K ,
adj LL ( tens A B ) L /\ merge JJ KK LL /\
adj JJ A J /\ mall J /\ adj KK B K /\ mall K
; mall ( one :: nil )
; mall L := exists A B LL J K ,
adj LL ( par A B ) L /\ adj LL A J /\ adj J B K /\ mall K
; mall L := exists LL , adj LL bot L /\ mall LL
; mall L := exists A B LL J K ,
adj LL ( wth A B ) L /\ adj LL A J /\ mall J /\ adj LL B K /\
mall K
; mall L := exists LL , adj LL top L
; mall L := exists A B LL J , adj LL ( plus A B ) L /\ adj LL A J
/\ mall J
; mall L := exists A B LL J , adj LL ( plus A B ) L /\ adj LL B J
/\ mall J .
#+END_SRC

- Why are all the heads =mall L=?

** Exchange rule (implicit)

They do not have an explicit exchange rule (benefit of not using lists and also using =adj=). Instead they say that if =|- K=, and =K= is a permutation of =L=, then =|- L= as well.

#+BEGIN_SRC abella
Theorem mall_perm : forall K L , mall K - > perm K L - > mall L .
#+END_SRC

** TODO Duality and inversions

- They set up the one-sided formulation in a way that the only height of the derivation containing the positive variant (not invertible) is relevant. (?)

- This requires an asymmetric dual predicate.

- Here is the code.

#+BEGIN_SRC abella
Define dual : o - > o - > prop by
; dual ( atom A ) ( natom A )
; dual ( tens A B ) ( par AA BB ) := dual A AA /\ dual B BB
; dual one bot
; dual ( plus A B ) ( wth AA BB ) := dual A AA /\ dual B BB
; dual zero top .
#+END_SRC

(?) Why is this asymmetric?

- Here are some inversion lemmas:

  #+BEGIN_SRC abella
Theorem bot_inv : forall J L, mall L -> adj J bot L -> mall J.
Theorem par_inv : forall L JJ A B, mall L -> adj JJ (par A B) L -> exists KK LL, adj JJ A KK /\ adj KK B LL /\ mall LL
  #+END_SRC


* Cut elim for MALL
