docs/ll-abella.html
<div id="outline-container-orgee12ab6" class="outline-3">
<h3 id="orgee12ab6"><span class="section-number-3">5.1.</span> Problem with contexts</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We quote the motivation for defining <code>adj</code> (and <code>merge</code> and <code>perm</code>).
</p>

<blockquote>
<p>
There is a wider than expected design space here. A first attempt might be
to simply use olist as our representation of contexts, with addition of elements
represented by list consing <code>(::)</code> and context joining with list append. This
makes inductive reasoning on contexts rather straightforward, but, because
linear contexts are structurally identical modulo exchange, it requires adding
explicit exchange rules to the system, which complicates the meta-theory. An
alternative that works is still to use olist as our representation, but to relax
the notion of structural identity as follows: two lists are structurally identical if
one is a permutation of the other. Thus, we need a predicate <code>perm : olist
-&gt; olist -&gt; prop</code> to recognize list permutations.
To define the addition operation with this modified notion, we could continue
to use list cons, but this will still require an explicit exchange rule. Instead, we
define a generalized cons operation, called <code>adj</code>
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orga3cd51d" class="outline-3">
<h3 id="orga3cd51d"><span class="section-number-3">5.2.</span> Idea: <code>adj</code>, <code>merge</code>, <code>perm</code></h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Multisets</li>

<li>They have typing predicates <code>is_o</code> (<code>o</code> means formula) and <code>is_list</code> (<code>olist</code> typing predicate). They are straightforward.</li>

<li><code>adj</code> is a generalized, non-deterministic cons operation. <code>adj J A K</code> says that the context <code>K</code> is the same as <code>J</code> but with <code>K</code> inserted somewhere.</li>

<li><code>perm</code> is list equality modulo ordering. As in, <code>perm J K</code> means that <code>J</code> and <code>K</code> have the same elements. This is done by multiple <code>adj</code>; A list <code>J</code> is a permutation of <code>K</code> if for all elements <code>A</code> in (<code>adj KK A K</code>) in <code>K</code>, it is in <code>L</code> (<code>adj LL A L</code>).</li>

<li><code>merge J K L</code> says that <code>L</code> is the union of <code>J</code> and <code>K</code>.
<code>merge</code> is non-deterministic because it has overlapping heads.
It says that <code>L</code> is the union of <code>J</code> and <code>K</code> (1) if for <code>A</code> in <code>J</code> (<code>adj JJ A J</code>), it is in <code>L</code> (<code>adj LL A L</code>) and (2) similarly for <code>A</code> in <code>K</code>.</li>
</ul>
</div>
</div>
<div id="outline-container-orgab72835" class="outline-3">
<h3 id="orgab72835"><span class="section-number-3">5.3.</span> <span class="todo TODO">TODO</span> Code</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Here is the code.
</p>

<div class="org-src-container">
<pre class="src src-abella">Type is_o o - &gt; prop .
Define is_list : olist - &gt; prop by
; is_list nil
; is_list ( A :: L ) := is_o A /\ is_list L .
% adj J A K : K is J with A inserted somewhere
Define adj : olist - &gt; o - &gt; olist - &gt; prop by
; adj L A ( A :: L ) := is_o A /\ is_list L
; adj ( B :: K ) A ( B :: L ) := is_o B /\ adj K A L .
% merge J K L : J union K equals L .
Define merge : olist - &gt; olist - &gt; olist - &gt; prop by
; merge nil nil nil
; merge J K L := exists A JJ LL , adj JJ A J /\ adj LL A L /\
merge JJ K LL
; merge J K L := exists A KK LL , adj KK A K /\ adj LL A L /\
merge J KK LL .
% perm J K : J and K have the same elements
Define perm : olist - &gt; olist - &gt; prop by
; perm nil nil
; perm K L :=
exists A KK LL , adj KK A K /\ adj LL A L /\ perm KK LL .
</pre>
</div>

<ul class="org-ul">
<li>Notice the overlapping heads for <code>merge</code>, which makes it nondeterministic.</li>
<li>(?) Why is <code>adj</code> non-deterministic?</li>
<li>Why do they have the existential quantifiers?</li>
</ul>
</div>
</div>
<div id="outline-container-org8847120" class="outline-3">
<h3 id="org8847120"><span class="section-number-3">5.4.</span> Multiset Theorems</h3>
<div class="outline-text-3" id="text-5-4">
<p>
The files <code>lib/merge.thm</code> and <code>lib/perm.thm</code> containts theorems about multisets.
</p>

<p>
Examples:
</p>
<ul class="org-ul">
<li><p>
<code>merge</code> is stable under permutation. If <code>L</code> is the union of <code>J</code> and <code>K</code>, and <code>JJ</code> is the same as <code>J</code> modulo permutation, then <code>L</code> is also the union of <code>JJ</code> and <code>K</code>.
</p>

<div class="org-src-container">
<pre class="src src-abella">  Theorem perm_merge_1 : forall J K L JJ,
  merge J K L - &gt; perm J JJ - &gt; merge JJ K L .
</pre>
</div></li>

<li><p>
<code>merge</code> is associative. Apparently this requires establishing that <code>perm</code> is an equivalence (transitive, reflexive, symmetric).
</p>

<div class="org-src-container">
<pre class="src src-abella">  Theorem merge_assoc : forall J K L JK KL JKL1 JKL2 ,
  merge J K JK - &gt; merge K L KL - &gt;
  merge J KL JKL1 - &gt; merge JK L JKL2 - &gt;
  perm JKL1 JKL2 .
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge40f269" class="outline-2">
<h2 id="orge40f269"><span class="section-number-2">6.</span> MALL (Multiplicative additive linear logic)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org373c61f" class="outline-3">
<h3 id="org373c61f"><span class="section-number-3">6.1.</span> Formulas</h3>
<div class="outline-text-3" id="text-6-1">
<p>
We seem to define the connectives as their own types, then define a formula inductively (typing predicate). Constrast this to SML or Coq where you simply define formulas as an inductive datatype.
</p>

<div class="org-src-container">
<pre class="src src-abella">Type atom , natom atm - &gt; o .
Type tens , par o - &gt; o - &gt; o .
Type one , bot o .
Type wth , plus o - &gt; o - &gt; o .
Type top , zero o .

Define is_fm : o - &gt; prop by
; is_fm ( atom A )
; is_fm ( natom A )
; is_fm ( tens A B ) := is_fm A /\ is_fm B
; is_fm one
; is_fm ( par A B ) := is_fm A /\ is_fm B
; is_fm bot
; is_fm ( wth A B ) := is_fm A /\ is_fm B
; is_fm top
; is_fm ( plus A B ) := is_fm A /\ is_fm B
; is_fm zero .
</pre>
</div>
</div>
</div>
<div id="outline-container-org61a7e66" class="outline-3">
<h3 id="org61a7e66"><span class="section-number-3">6.2.</span> <span class="todo TODO">TODO</span> Inference rules</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Here is the code for the inference rules of the fragment of MALL.
</p>

<div class="org-src-container">
<pre class="src src-nil">Define mall : olist - &gt; prop by
; mall L := exists A , adj ( natom A :: nil ) ( atom A ) L
; mall L := exists A B LL JJ KK J K ,
adj LL ( tens A B ) L /\ merge JJ KK LL /\
adj JJ A J /\ mall J /\ adj KK B K /\ mall K
; mall ( one :: nil )
; mall L := exists A B LL J K ,
adj LL ( par A B ) L /\ adj LL A J /\ adj J B K /\ mall K
; mall L := exists LL , adj LL bot L /\ mall LL
; mall L := exists A B LL J K ,
adj LL ( wth A B ) L /\ adj LL A J /\ mall J /\ adj LL B K /\
mall K
; mall L := exists LL , adj LL top L
; mall L := exists A B LL J , adj LL ( plus A B ) L /\ adj LL A J
/\ mall J
; mall L := exists A B LL J , adj LL ( plus A B ) L /\ adj LL B J
/\ mall J .
</pre>
</div>

<ul class="org-ul">
<li>Why are all the heads <code>mall L</code>?</li>
</ul>
</div>
</div>
<div id="outline-container-org71be7db" class="outline-3">
<h3 id="org71be7db"><span class="section-number-3">6.3.</span> Exchange rule (implicit)</h3>
<div class="outline-text-3" id="text-6-3">
<p>
They do not have an explicit exchange rule (benefit of not using lists and also using <code>adj</code>). Instead they say that if <code>|- K</code>, and <code>K</code> is a permutation of <code>L</code>, then <code>|- L</code> as well.
</p>

<div class="org-src-container">
<pre class="src src-abella">Theorem mall_perm : forall K L , mall K - &gt; perm K L - &gt; mall L .
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfb99796" class="outline-3">
<h3 id="orgfb99796"><span class="section-number-3">6.4.</span> <span class="todo TODO">TODO</span> Duality and inversions</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>They set up the one-sided formulation in a way that the only height of the derivation containing the positive variant (not invertible) is relevant. (?)</li>

<li>This requires an asymmetric dual predicate.</li>

<li>Here is the code.</li>
</ul>

<div class="org-src-container">
<pre class="src src-abella">Define dual : o - &gt; o - &gt; prop by
; dual ( atom A ) ( natom A )
; dual ( tens A B ) ( par AA BB ) := dual A AA /\ dual B BB
; dual one bot
; dual ( plus A B ) ( wth AA BB ) := dual A AA /\ dual B BB
; dual zero top .
</pre>
</div>

<p>
(?) Why is this asymmetric?
</p>

<ul class="org-ul">
<li><p>
Here are some inversion lemmas:
</p>

<div class="org-src-container">
<pre class="src src-abella">Theorem bot_inv : forall J L, mall L -&gt; adj J bot L -&gt; mall J.
Theorem par_inv : forall L JJ A B, mall L -&gt; adj JJ (par A B) L -&gt; exists KK LL, adj JJ A KK /\ adj KK B LL /\ mall LL
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgac718a8" class="outline-2">
<h2 id="orgac718a8"><span class="section-number-2">7.</span> Cut elim for MALL</h2>
<div class="outline-text-2" id="text-7">
</div>
