docs/ll-abella.org
** TODO Statement

- Here is how it is encoded.

#+BEGIN_SRC abella
Theorem cut : forall A B JJ J KK K LL ,
dual A B ->
adj JJ A J -> mall J ->
adj KK B K -> mall K ->
merge JJ KK LL ->
mall LL .
#+END_SRC

- Why is this how it's encoded?
** TODO Proof strategy

- The proof proceeds by nested induction on the first and third assumptions.

- This encodes the following measure for appealing to the IHs: either the rank decreases because of case analysis of =dual A B=, or the rank stays the same and the height of =mall J=, which is the derivation that contains the positive half of the cut formula pair, decreases.

- Is this what is known as a lexicographic induction?

- Whe have to show that cuts can be reduced to cuts of lower rank.
*** TODO Rest of the proof

- (TODO) Read pages 13 and 14 while following the proof interactively in Abella.

** TODO Cut Admissiblity for Exponential Case

- Apparently, adding exponentials complicates the cut elimination proof by induction.
- The termination measures are more complex.
- The problem is that there is a case where a cut instance is not a lower measure.
- They try to solve it by incorporating multiset orderings, which is apparently not yet supported by Abella's size annotations.
- Instead, they move to a dyadic sequent calculus. Now they induct on another measure (weight).

- See page 16.

* TODO First-order case

First order means we introduce the existential and universal quantifier.

** TODO Two Level logic approcach

- Recall the two-level logic approach in 2.2 that simplifies reasoning about quantifiers and instantiation.

- This means we move from the code so far (which is apparently in the reasoning level) to the specification logic of  =\lambda= Prolog (henceforth LProlog).


I haven't read this carefully yet.

* TODO Focused Calculi

- They also prove cut-admissibility for focused proof systems for linear logic.
- Focused systems group connectives by polarity. Polarity is either invertible (-) or non-invertible (+).
- Focused systems cut down on non-determinism.
- Main difficulty with focused proofs is that "cuts are not permuted step by step above single connectives but must rather permute past entire phases".
- They completed the cut-elimination argument for focused first-order MALL.

* TODO Two Sided Calculi

- They implemented two sided calculus for MALL.
- The two sided formulation has left and right introduction rules.
- "Cut rules apply to fomrulas on either side of the sequent rather than in terms of duality"

* Related Work

- Generic method for formalizing sequent calculi in Isabelle/HOL by Dawson, Gore (2010).
  Proved cut-elimination for =GLS_v= provability logic.
- Pattinson and Schroder formalized cut-elimination for coalgebraic logics in Coq (2013). They implemented multisets as setoids with an underlying list type and permuation relation.
- To avoid dealing with explicit representations of contexts, some find different representations for sequent calculus rules that mention only the principal and auxiliary formula. (Pfenning, 1995) annotates sequents with proof terms, which reduces cut elimination to a type checking problem on the proof terms.
- Pfenning's method was used by Simmons (2014) to formalize completeness of focusing in intuitionistic logic. Apparently he avoids showing invertibility lemmas.
- Some other linear logic encodings focused on obtaining proof search engines (no proofs for metatheorems).
- In LL-coq, they implemented a multiset library and used PHOAS for quantifiers.
