docs/ll-abella.html
<div id="outline-container-org867cabe" class="outline-3">
<h3 id="org867cabe"><span class="section-number-3">7.1.</span> <span class="todo TODO">TODO</span> Statement</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Here is how it is encoded.</li>
</ul>

<div class="org-src-container">
<pre class="src src-abella">Theorem cut : forall A B JJ J KK K LL ,
dual A B -&gt;
adj JJ A J -&gt; mall J -&gt;
adj KK B K -&gt; mall K -&gt;
merge JJ KK LL -&gt;
mall LL .
</pre>
</div>

<ul class="org-ul">
<li>Why is this how it&rsquo;s encoded?</li>
</ul>
</div>
</div>
<div id="outline-container-orgffb249b" class="outline-3">
<h3 id="orgffb249b"><span class="section-number-3">7.2.</span> <span class="todo TODO">TODO</span> Proof strategy</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>The proof proceeds by nested induction on the first and third assumptions.</li>

<li>This encodes the following measure for appealing to the IHs: either the rank decreases because of case analysis of <code>dual A B</code>, or the rank stays the same and the height of <code>mall J</code>, which is the derivation that contains the positive half of the cut formula pair, decreases.</li>

<li>Is this what is known as a lexicographic induction?</li>

<li>Whe have to show that cuts can be reduced to cuts of lower rank.</li>
</ul>
</div>
<div id="outline-container-org2c4211f" class="outline-4">
<h4 id="org2c4211f"><span class="todo TODO">TODO</span> Rest of the proof</h4>
<div class="outline-text-4" id="text-org2c4211f">
<ul class="org-ul">
<li>(TODO) Read pages 13 and 14 while following the proof interactively in Abella.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb9d1acb" class="outline-3">
<h3 id="orgb9d1acb"><span class="section-number-3">7.3.</span> <span class="todo TODO">TODO</span> Cut Admissiblity for Exponential Case</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Apparently, adding exponentials complicates the cut elimination proof by induction.</li>
<li>The termination measures are more complex.</li>
<li>The problem is that there is a case where a cut instance is not a lower measure.</li>
<li>They try to solve it by incorporating multiset orderings, which is apparently not yet supported by Abella&rsquo;s size annotations.</li>
<li>Instead, they move to a dyadic sequent calculus. Now they induct on another measure (weight).</li>

<li>See page 16.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1fe9d83" class="outline-2">
<h2 id="org1fe9d83"><span class="section-number-2">8.</span> <span class="todo TODO">TODO</span> First-order case</h2>
<div class="outline-text-2" id="text-8">
<p>
First order means we introduce the existential and universal quantifier.
</p>
</div>
<div id="outline-container-org521cae4" class="outline-3">
<h3 id="org521cae4"><span class="section-number-3">8.1.</span> <span class="todo TODO">TODO</span> Two Level logic approcach</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Recall the two-level logic approach in 2.2 that simplifies reasoning about quantifiers and instantiation.</li>

<li>This means we move from the code so far (which is apparently in the reasoning level) to the specification logic of  <code>\lambda</code> Prolog (henceforth LProlog).</li>
</ul>


<p>
I haven&rsquo;t read this carefully yet.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfe1cb9b" class="outline-2">
<h2 id="orgfe1cb9b"><span class="section-number-2">9.</span> <span class="todo TODO">TODO</span> Focused Calculi</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>They also prove cut-admissibility for focused proof systems for linear logic.</li>
<li>Focused systems group connectives by polarity. Polarity is either invertible (-) or non-invertible (+).</li>
<li>Focused systems cut down on non-determinism.</li>
<li>Main difficulty with focused proofs is that &ldquo;cuts are not permuted step by step above single connectives but must rather permute past entire phases&rdquo;.</li>
<li>They completed the cut-elimination argument for focused first-order MALL.</li>
</ul>
</div>
</div>
<div id="outline-container-org0385b22" class="outline-2">
<h2 id="org0385b22"><span class="section-number-2">10.</span> <span class="todo TODO">TODO</span> Two Sided Calculi</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>They implemented two sided calculus for MALL.</li>
<li>The two sided formulation has left and right introduction rules.</li>
<li>&ldquo;Cut rules apply to fomrulas on either side of the sequent rather than in terms of duality&rdquo;</li>
</ul>
</div>
</div>
<div id="outline-container-org0134233" class="outline-2">
<h2 id="org0134233"><span class="section-number-2">11.</span> Related Work</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Generic method for formalizing sequent calculi in Isabelle/HOL by Dawson, Gore (2010).
Proved cut-elimination for <code>GLS_v</code> provability logic.</li>
<li>Pattinson and Schroder formalized cut-elimination for coalgebraic logics in Coq (2013). They implemented multisets as setoids with an underlying list type and permuation relation.</li>
<li>To avoid dealing with explicit representations of contexts, some find different representations for sequent calculus rules that mention only the principal and auxiliary formula. (Pfenning, 1995) annotates sequents with proof terms, which reduces cut elimination to a type checking problem on the proof terms.</li>
<li>Pfenning&rsquo;s method was used by Simmons (2014) to formalize completeness of focusing in intuitionistic logic. Apparently he avoids showing invertibility lemmas.</li>
<li>Some other linear logic encodings focused on obtaining proof search engines (no proofs for metatheorems).</li>
<li>In LL-coq, they implemented a multiset library and used PHOAS for quantifiers.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-05-20 Tue 14:12</p>
</div>
</body>
</html>
